/* 선택 정렬이 되는 과정
let 전 = [199, 22, 33, 12, 32, 64, 72, 222, 233];
let 후 = [];

let 전 = [199, 22, 33, , 32, 64, 72, 222, 233];
let 후 = [12];

let 전 = [199, , 33, , 32, 64, 72, 222, 233];
let 후 = [12, 22];

let 전 = [199, , 33, , , 64, 72, 222, 233];
let 후 = [12, 22 32];

let 전 = [199, , , , , 64, 72, 222, 233];
let 후 = [12, 22 32 33];

let 전 = [199, , , , , , 72, 222, 233];
let 후 = [12, 22 32 33 64];

let 전 = [199, , , , , , , 222, 233];
let 후 = [12, 22 32 33 64 72];

let 전 = [, , , , , , , 222, 233];
let 후 = [12, 22 32 33 64 72 199];

let 전 = [, , , , , , , , 233];
let 후 = [12, 22 32 33 64 72 199 222];

let 전 = [, , , , , , , , ];
let 후 = [12, 22 32 33 64 72 199 222 233];
*/

let 입력값 = [199, 22, 33, 12, 32, 64, 72, 222, 233];
let 정렬된배열 = [];
let 길이 = 입력값.length;

// 주의해야할 사항@@@ pop을 하면 length가 줄어든다.
// for(let i = 0; i < 입력값.length; i++){
//   console.log(입력값.pop());
//   console.log(i);
// }

for(let i = 0; i < 길이; i++){
  let 최솟값 = Math.min(...입력값);
  정렬된배열.push(최솟값);
  입력값.splice(입력값.indexOf(최솟값), 1);
}

console.log(정렬된배열);