/* 
병합 정렬 과정 
let 입력값 = [5, 10, 66, 77, 54, 32, 11, 15];
let 정렬된배열 = [];

// 분할
1. [5, 10, 66, 77, 54, 32, 11, 15]
2. [5, 10, 66, 77] [54, 32, 11, 15]
3. [5, 10] [ 66, 77] [54, 32] [ 11, 15]
4. [5] [10] [66] [77] [54] [32] [11] [15]

// 정복(0번째끼리 비교)
5. [5, 10] [ 66, 77] | [32, 54] [11, 15]
6. [5, 10, 66, 77] | [11, 15, 32, 54]
7. [5, 10, 11, 15, 32, 54, 66, 77]
*/

let 입력값 = [5, 10, 66, 77, 54, 32, 11, 15]

function 병합정렬(입력배열){
  let 입력배열의길이 = 입력배열.length;
  if(입력배열의길이 <= 1){
    // 하나만 있으면 정렬할 필요가 없으니까 이렇게 예외처리~!
    return 입력배열;
  }
  let 중간값 = parseInt(입력배열의길이 / 2)
  let 그룹하나 = 병합정렬(입력배열.slice(0, 중간값))
  let 그룹둘 = 병합정렬(입력배열.slice(중간값))
}

